const books = [
    {
        "id": 1,
        "Название": "Цветы для Элджернона",
        "Автор": "Дэниел Киз",
        "Год издания": 2015,
        "Жанр": "Фантастика",
        "Рейтинг": 4.6
    },
    {
        "id": 2,
        "Название": "Гарри Поттер и философский камень",
        "Автор": "Джоан Роулинг",
        "Год издания": 2017,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.7
    },
    {
        "id": 3,
        "Название": "1984",
        "Автор": "Джордж Оруэлл",
        "Год издания": 2021,
        "Жанр": "Фантастика",
        "Рейтинг": 4.4
    },
    {
        "id": 4,
        "Название": "451° по Фаренгейту",
        "Автор": "Рэй Брэдбери",
        "Год издания": 2021,
        "Жанр": "Фантастика",
        "Рейтинг": 4.3
    },
    {
        "id": 5,
        "Название": "Мастер и Маргарита",
        "Автор": "Михаил Булгаков",
        "Год издания": 2015,
        "Жанр": "Роман",
        "Рейтинг": 4.54
    },
    {
        "id": 6,
        "Название": "Портрет Дориана Грея",
        "Автор": "Оскар Уайльд",
        "Год издания": 2021,
        "Жанр": "Классика",
        "Рейтинг": 4.28
    },
    {
        "id": 7,
        "Название": "Гордость и предубеждение",
        "Автор": "Джейн Остин",
        "Год издания": 2019,
        "Жанр": "Роман",
        "Рейтинг": 4.52
    },
    {
        "id": 8,
        "Название": "Гарри Поттер и узник Азкабана",
        "Автор": "Джоан Роулинг",
        "Год издания": 2019,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.77
    },
    {
        "id": 9,
        "Название": "Гарри Поттер и Тайная комната",
        "Автор": "Джоан Роулинг",
        "Год издания": 2016,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.73
    },
    {
        "id": 10,
        "Название": "Вторая жизнь Уве",
        "Автор": "Фредрик Бакман",
        "Год издания": 2021,
        "Жанр": "Роман",
        "Рейтинг": 4.62
    },
    {
        "id": 11,
        "Название": "Убить пересмешника",
        "Автор": "Харпер Ли",
        "Год издания": 2018,
        "Жанр": "Классика",
        "Рейтинг": 4.56
    },
    {
        "id": 12,
        "Название": "Джейн Эйр",
        "Автор": "Шарлотта Бронте",
        "Год издания": 2011,
        "Жанр": "Классика",
        "Рейтинг": 4.46
    },
    {
        "id": 13,
        "Название": "Мартин Иден",
        "Автор": "Джек Лондон",
        "Год издания": 2014,
        "Жанр": "Классика",
        "Рейтинг": 4.53
    },
    {
        "id": 14,
        "Название": "Гарри Поттер и Кубок огня",
        "Автор": "Джоан Роулинг",
        "Год издания": 2019,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.74
    },
    {
        "id": 15,
        "Название": "Десять негритят",
        "Автор": "Агата Кристи",
        "Год издания": 2012,
        "Жанр": "Детектив",
        "Рейтинг": 4.61
    },
    {
        "id": 16,
        "Название": "Преступление и наказание",
        "Автор": "Фёдор Достоевский",
        "Год издания": 2012,
        "Жанр": "Классика",
        "Рейтинг": 4.4
    },
    {
        "id": 17,
        "Название": "Мара и Морок",
        "Автор": "Лия Арден",
        "Год издания": 2020,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.38
    },
    {
        "id": 18,
        "Название": "Великий Гэтсби",
        "Автор": "Фрэнсис Скотт Фицджеральд",
        "Год издания": 2018,
        "Жанр": "Классика",
        "Рейтинг": 4.13
    },
    {
        "id": 19,
        "Название": "Книжный вор",
        "Автор": "Маркус Зусак",
        "Год издания": 2016,
        "Жанр": "Роман",
        "Рейтинг": 4.58
    },
    {
        "id": 20,
        "Название": "Повелитель мух",
        "Автор": "Уильям Голдинг",
        "Год издания": 2017,
        "Жанр": "Классика",
        "Рейтинг": 4.02
    },
    {
        "id": 21,
        "Название": "Тринадцатая сказка",
        "Автор": "Диана Сеттерфилд",
        "Год издания": 2015,
        "Жанр": "Роман",
        "Рейтинг": 4.31
    },
    {
        "id": 22,
        "Название": "О дивный новый мир",
        "Автор": "Олдос Хаксли",
        "Год издания": 2020,
        "Жанр": "Классика",
        "Рейтинг": 4.16
    },
    {
        "id": 23,
        "Название": "Герой нашего времени",
        "Автор": "Михаил Лермонтов",
        "Год издания": 2013,
        "Жанр": "Классика",
        "Рейтинг": 4.32
    },
    {
        "id": 24,
        "Название": "Над пропастью во ржи",
        "Автор": "Джером Д. Сэлинджер",
        "Год издания": 2013,
        "Жанр": "Классика",
        "Рейтинг": 3.73
    },
    {
        "id": 25,
        "Название": "Гарри Поттер и Орден Феникса",
        "Автор": "Джоан Роулинг",
        "Год издания": 2015,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.71
    },
    {
        "id": 26,
        "Название": "Шестерка воронов",
        "Автор": "Ли Бардуго",
        "Год издания": 2021,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.58
    },
    {
        "id": 27,
        "Название": "Мара и Морок. Особенная Тень",
        "Автор": "Лия Арден",
        "Год издания": 2020,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.47
    },
    {
        "id": 28,
        "Название": "Тревожные люди",
        "Автор": "Фредрик Бакман",
        "Год издания": 2020,
        "Жанр": "Роман",
        "Рейтинг": 4.4
    },
    {
        "id": 29,
        "Название": "Таинственная история Билли Миллигана",
        "Автор": "Дэниел Киз",
        "Год издания": 2011,
        "Жанр": "Документальный роман",
        "Рейтинг": 4.41
    },
    {
        "id": 30,
        "Название": "Три товарища",
        "Автор": "Эрих Мария Ремарк",
        "Год издания": 2019,
        "Жанр": "Классика",
        "Рейтинг": 4.53
    },
    {
        "id": 31,
        "Название": "Коллекционер",
        "Автор": "Джон Фаулз",
        "Год издания": 2015,
        "Жанр": "Триллер",
        "Рейтинг": 4.19
    },
    {
        "id": 32,
        "Название": "Безмолвный пациент",
        "Автор": "Алекс Михаэлидес",
        "Год издания": 2020,
        "Жанр": "Детектив",
        "Рейтинг": 4.11
    },
    {
        "id": 33,
        "Название": "Гарри Поттер и Дары Смерти",
        "Автор": "Джоан Роулинг",
        "Год издания": 2015,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.75
    },
    {
        "id": 34,
        "Название": "Маленькие женщины",
        "Автор": "Луиза Мэй Олкотт",
        "Год издания": 2020,
        "Жанр": "Классика",
        "Рейтинг": 4.31
    },
    {
        "id": 35,
        "Название": "Тень и кость",
        "Автор": "Ли Бардуго",
        "Год издания": 2021,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.12
    },
    {
        "id": 36,
        "Название": "Внутри убийцы",
        "Автор": "Майк Омер",
        "Год издания": 2020,
        "Жанр": "Триллер",
        "Рейтинг": 4.38
    },
    {
        "id": 37,
        "Название": "Дом, в котором...",
        "Автор": "Мариам Петросян",
        "Год издания": 2023,
        "Жанр": "Роман",
        "Рейтинг": 4.42
    },
    {
        "id": 38,
        "Название": "Воздушный народ. Жестокий принц",
        "Автор": "Холли Блэк",
        "Год издания": 2022,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.27
    },
    {
        "id": 39,
        "Название": "Ребекка",
        "Автор": "Дафна дю Морье",
        "Год издания": 2020,
        "Жанр": "Триллер",
        "Рейтинг": 4.33
    },
    {
        "id": 40,
        "Название": "Тайная история",
        "Автор": "Донна Тартт",
        "Год издания": 2021,
        "Жанр": "Детектив",
        "Рейтинг": 4.32
    },
    {
        "id": 41,
        "Название": "Восхитительная ведьма",
        "Автор": "Анна Джейн",
        "Год издания": 2020,
        "Жанр": "Любовный роман",
        "Рейтинг": 4.57
    },
    {
        "id": 42,
        "Название": "Прислуга",
        "Автор": "Кэтрин Стокетт",
        "Год издания": 2016,
        "Жанр": "Классика",
        "Рейтинг": 4.68
    },
    {
        "id": 43,
        "Название": "Кладбище домашних животных",
        "Автор": "Стивен Кинг",
        "Год издания": 2022,
        "Жанр": "Ужасы",
        "Рейтинг": 4.37
    },
    {
        "id": 44,
        "Название": "Жареные зеленые помидоры в кафе «Полустанок»",
        "Автор": "Фэнни Флэгг",
        "Год издания": 2017,
        "Жанр": "Роман",
        "Рейтинг": 4.3
    },
    {
        "id": 45,
        "Название": "Продажное королевство",
        "Автор": "Ли Бардуго",
        "Год издания": 2018,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.65
    },
    {
        "id": 46,
        "Название": "Королевство шипов и роз",
        "Автор": "Сара Дж. Маас",
        "Год издания": 2020,
        "Жанр": "Фэнтези",
        "Рейтинг": 4.28
    },
    {
        "id": 47,
        "Название": "Поющие в терновнике",
        "Автор": "Колин Маккалоу",
        "Год издания": 2020,
        "Жанр": "Любовный роман",
        "Рейтинг": 4.49
    },
    {
        "id": 48,
        "Название": "Триумфальная арка",
        "Автор": "Эрих Мария Ремарк",
        "Год издания": 2020,
        "Жанр": "Классика",
        "Рейтинг": 4.46
    },
    {
        "id": 49,
        "Название": "Зеленая миля",
        "Автор": "Стивен Кинг",
        "Год издания": 2022,
        "Жанр": "Ужасы",
        "Рейтинг": 4.71
    },
    {
        "id": 50,
        "Название": "Зов Кукушки",
        "Автор": "Роберт Гэлбрейт",
        "Год издания": 2019,
        "Жанр": "Детектив",
        "Рейтинг": 4.14
    }
];

export default books;