export type tTasks ={
    "question": string; /* вопрос задания*/
    "answer": string; /* ответ задания*/
}[]

export type tQuizes = {
    "id": number, 
    "type": "M" |  "S" | "CO" | "CS", /* типы заданий, М - сопоставление*/
    "title": string, /* формулировка задания */
    "tasks": tTasks, 
}[];

export const quiz: tQuizes = [
  {
    "id": 1,
    "type": "M",
    "title": "Соотнесите автора с его книгой.",
    "tasks": [
      {
        "question": "Фредрик Бакман",
        "answer":  `"Тревожные люди"`
      },
      {
        "question": "Стивен Кинг",
        "answer": `"Зеленая миля"`
      },
      {
        "question": "Ли Бардуго",
        "answer": `"Шестерка воронов"`
      }
    ]
  },
  {
    "id": 2,
    "type": "M",
    "title": "Установите соответствие между жанром и книгой.",
    "tasks": [
      {
        "question": "Детектив",
        "answer": `"Десять негритят"`
      },
      {
        "question": "Ужасы",
        "answer": `"Кладбище домашних животных"`
      },
      {
        "question": "Роман",
        "answer": `"Вторая жизнь Уве"`
      }
    ]
  },
  {
    "id": 3,
    "type": "S",
    "title": "Расположите книги в порядке убывания рейтинга.",
    "tasks": [
      {
        "question": `"Зеленая миля"`,
        "answer": `3`
      },
      {
        "question": `"Гарри Поттер и узник Азкабана"`,
        "answer": `1`
      },
      {
        "question": `"Прислуга"`,
        "answer": `4`
      },
      {
        "question": `"Гарри Поттер и Дары Смерти"`,
        "answer": `2`
      }
    ]
  },
  {
    "id": 4,
    "type": "S",
    "title": "Расположите авторов по количеству книг в таблице (от большего к меньшему)",
    "tasks": [
      {
        "question": "Фредрик Бакман",
        "answer": `4`
      },
      {
        "question": "Ли Бардуго",
        "answer": `2`
      },
      {
        "question": "Джоан Роулинг",
        "answer": `1`
      },
      {
        "question": "Лия Арден",
        "answer": `3`
      }
    ]
  },
  {
    "id": 5,
    "type": "CO",
    "title": "Какая книга, изданная в 2021 году, имеет самый высокий рейтинг?",
    "tasks": [
      {
        "question": `"1984"`,
        "answer": `0`
      },
      {
        "question": `"Шестерка воронов"`,
        "answer": `1`
      },
      {
        "question": `"Тень и кость"`,
        "answer": `0`
      },
      {
        "question": `"Герой нашего времени"`,
        "answer": `0`
      }
    ]
  },
  {
    "id": 6,
    "type": "CS",
    "title": "Выберите всех авторов, у которых в таблице есть хотя бы одна книга с рейтингом выше 4.7:",
    "tasks": [
      {
        "question": "Михаил Булгаков",
        "answer": `0`
      },
      {
        "question": "Ли Бардуго",
        "answer": `0`
      },
      {
        "question": "Стивен Кинг",
        "answer": `1`
      },
      {
        "question": "Фредрик Бакман",
        "answer": `0`
      },
      {
        "question": "Джоан Роулинг",
        "answer": `1`
      }
    ]
  }
]